Tekla.Structures.ModelInternal.BuildingSpaces.Space
Building space.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.parent
Backing field for the parent space of the space.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Name
Gets or sets the space name.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Number
Gets or sets the space name.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Zone
Gets or sets the space name.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Description
Gets or sets the space description.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Height
Gets or sets the space height.
Remarks:  The Space is a prism which bottom polygon is specified by Tekla.Structures.ModelInternal.BuildingSpaces.Space.Contour, shifted by Tekla.Structures.ModelInternal.BuildingSpaces.Space.BottomOffset and height specified as Tekla.Structures.ModelInternal.BuildingSpaces.Space.Height.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.BottomOffset
Gets or sets the space bottom offset.
Remarks:  The Space is a prism which bottom polygon is specified by Tekla.Structures.ModelInternal.BuildingSpaces.Space.Contour, shifted by Tekla.Structures.ModelInternal.BuildingSpaces.Space.BottomOffset and height specified as Tekla.Structures.ModelInternal.BuildingSpaces.Space.Height.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Volume
Gets or sets the space volume.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Contour
Gets or sets the space contour. The work plane coordinates are used.
Remarks:  The Space is a prism which bottom polygon is specified by Tekla.Structures.ModelInternal.BuildingSpaces.Space.Contour, shifted by Tekla.Structures.ModelInternal.BuildingSpaces.Space.BottomOffset and height specified as Tekla.Structures.ModelInternal.BuildingSpaces.Space.Height.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.BrepShapeName
Gets or sets the geometry shape name, from shape catalog.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Parent
Gets or sets the parent storey of the space.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.Delete


Tekla.Structures.ModelInternal.BuildingSpaces.Space.Insert


Tekla.Structures.ModelInternal.BuildingSpaces.Space.Modify


Tekla.Structures.ModelInternal.BuildingSpaces.Space.Select


Tekla.Structures.ModelInternal.BuildingSpaces.Space.GetSolid
Returns the solid of the space.
Returns: The solid of the space.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.SelectAssignedObjects
Select assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.HideAssignedObjects
Hide assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.ShowAssignedObjects
Show previously hidden assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingSpaces.Space.ShowOnlyAssignedObjects
Show only assigned objects in 3d view.